//RUNBANCO JOB 1,NOTIFY=&SYSUID
//***************************************
//COBRUN EXEC IGYWCL
//COBOL.SYSIN DD DSN=&SYSUID..CBL(BANCOCOR),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(BANCOCOR),DISP=SHR
//***************************************
//RUN      EXEC PGM=BANCOCOR,COND=(0,NE)
//STEPLIB  DD DSN=&SYSUID..LOAD,DISP=SHR
//ENTRADA  DD DSN=&SYSUID..DATOS.TRANSACC,DISP=SHR
//SALIDA   DD DSN=&SYSUID..DATOS.SALDOS,DISP=OLD
//ERRORES  DD DSN=&SYSUID..DATOS.ERRORES,DISP=OLD
//SYSOUT   DD SYSOUT=*,OUTLIM=15000
//CEEDUMP  DD DUMMY
//SYSUDUMP DD DUMMY
//**************************************
//PRINT    EXEC PGM=IEBGENER,COND=(0,NE)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=&SYSUID..DATOS.SALDOS,DISP=SHR
//SYSUT2   DD SYSOUT=*,OUTLIM=15000
//SYSIN    DD DUMMY
//**************************************
//PRINTERR EXEC PGM=IEBGENER,COND=(0,NE)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=&SYSUID..DATOS.ERRORES,DISP=SHR
//SYSUT2   DD SYSOUT=*,OUTLIM=15000
//SYSIN    DD DUMMY


